## About pandas and series

üêº Pandas in Python

Pandas is an open-source Python library used for data manipulation and analysis.
It provides fast, flexible, and expressive data structures.

 üîπPandas Series
üìå Definition

A Series is a one-dimensional labeled array capable of storing different data types.

üëâ Similar to a single column in a table.



üîπ Pandas DataFrame
üìå Definition

A DataFrame is a two-dimensional labeled data structure with:

rows

columns

üëâ Similar to a table in a database or Excel sheet.

In [1]:
import pandas as pd

In [3]:
##Panads series --> 1D as column in a table that can hold any type of data

import pandas as pd
data=[1,2,3,4,5]
series=pd.Series(data)
print(series)  ## with default indexes from 0
print(type(series))

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [4]:
## Sries from dictionary element
## here key become as index i.e a,b and c
data={'a':1,'b':2,'c':3} 
d=pd.Series(data)
print(d)

a    1
b    2
c    3
dtype: int64

In [5]:
data=[10,20,30,40]
index=['a','b','c','d']
pd.Series(data,index)

a    10
b    20
c    30
d    40
dtype: int64

## Dataframe 
 as table with rows and column

In [8]:
## Create dataframe with dictionary

## basically 3 column and 3 rows
data={
    'Name':['Alka','Tanay','Arisha'],
    'Age':[20,20,19],
    'City':['Bangalore','Dehli','New York']

}
df=pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age       City
0    Alka   20  Bangalore
1   Tanay   20      Dehli
2  Arisha   19   New York
<class 'pandas.core.frame.DataFrame'>

In [9]:
import numpy as np
np.array(df)

array([['Alka', 20, 'Bangalore'],
       ['Tanay', 20, 'Dehli'],
       ['Arisha', 19, 'New York']], dtype=object)

In [11]:
## Create a data frame from list of dictionary
data=[
    {'Name':'Alka','Age':19,'City':'Dehli'},
     {'Name':'Kush','Age':20,'City':'Naini'},
      {'Name':'Krish','Age':60,'City':'Goa'},

]
df=pd.DataFrame(data)
print(df)

    Name  Age   City
0   Alka   19  Dehli
1   Kush   20  Naini
2  Krish   60    Goa

## Working on CSV files

In [15]:

df=pd.read_csv('sales_data.csv')

df.tail(5)

,Order_ID,Order_Date,Customer_Name,Product,Category,Quantity,Price,Payment_Mode,Region,Total_Amount
5,1006,2025-01-06,Sneha,Tablet,Electronics,1,25000,Credit Card,South,25000
6,1007,2025-01-07,Pooja,Smartwatch,Wearables,1,10000,UPI,East,10000
7,1008,2025-01-08,Karan,Camera,Electronics,1,40000,Debit Card,West,40000
8,1009,2025-01-09,Simran,Printer,Electronics,1,12000,Cash,North,12000
9,1010,2025-01-10,Ankit,Speaker,Accessories,2,5000,UPI,South,10000

In [16]:
df.head(5)

,Order_ID,Order_Date,Customer_Name,Product,Category,Quantity,Price,Payment_Mode,Region,Total_Amount
0,1001,2025-01-01,Alka,Laptop,Electronics,1,60000,UPI,North,60000
1,1002,2025-01-02,Riya,Mobile,Electronics,2,20000,Credit Card,South,40000
2,1003,2025-01-03,Neha,Headphones,Accessories,1,3000,Debit Card,East,3000
3,1004,2025-01-04,Aman,Keyboard,Accessories,1,1500,UPI,West,1500
4,1005,2025-01-05,Rohit,Mouse,Accessories,2,800,Cash,North,1600

## Acessing the data from DataFram

üîπ When to Use What?

1)Use loc when working with labels or conditions

2)Use iloc when working with positions

df.loc[row_label, column_label]

df.iloc[row_index, column_index]


s = pd.Series([10, 20, 30], index=['a', 'b', 'c'])

s.loc['b']   # 20
s.iloc[1]    # 20

In [18]:
df

,Order_ID,Order_Date,Customer_Name,Product,Category,Quantity,Price,Payment_Mode,Region,Total_Amount
0,1001,2025-01-01,Alka,Laptop,Electronics,1,60000,UPI,North,60000
1,1002,2025-01-02,Riya,Mobile,Electronics,2,20000,Credit Card,South,40000
2,1003,2025-01-03,Neha,Headphones,Accessories,1,3000,Debit Card,East,3000
3,1004,2025-01-04,Aman,Keyboard,Accessories,1,1500,UPI,West,1500
4,1005,2025-01-05,Rohit,Mouse,Accessories,2,800,Cash,North,1600
5,1006,2025-01-06,Sneha,Tablet,Electronics,1,25000,Credit Card,South,25000
6,1007,2025-01-07,Pooja,Smartwatch,Wearables,1,10000,UPI,East,10000
7,1008,2025-01-08,Karan,Camera,Electronics,1,40000,Debit Card,West,40000
8,1009,2025-01-09,Simran,Printer,Electronics,1,12000,Cash,North,12000
9,1010,2025-01-10,Ankit,Speaker,Accessories,2,5000,UPI,South,10000

In [20]:
data=[
    {'Name':'Alka','Age':19,'City':'Dehli'},
     {'Name':'Kush','Age':20,'City':'Naini'},
      {'Name':'Krish','Age':60,'City':'Goa'},

]
df=pd.DataFrame(data)
df

    Name  Age   City
0   Alka   19  Dehli
1   Kush   20  Naini
2  Krish   60    Goa

In [22]:
type(df['Name'])  ## it become series

pandas.core.series.Series

In [24]:
df.loc[0] ## Row index

Name     Alka
Age        19
City    Dehli
Name: 0, dtype: object

In [25]:
df.iloc[0] ## Column index

Name     Alka
Age        19
City    Dehli
Name: 0, dtype: object

In [29]:
df.iloc[0][2]  ## index location

C:\Users\Dell\AppData\Local\Temp\ipykernel_27444\2519637664.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]

'Dehli'

## Accesing a specified element


at and iat are scalar accessors used to get or set a single value in a DataFrame or Series.

üëâ They are faster than loc and iloc because they work with only one cell.


loc ‚Üí multiple rows/columns, filtering

iloc ‚Üí slicing by position

at ‚Üí fastest single value (label-based)

iat ‚Üí fastest single value (position-based)

In [30]:
df['Name']

0     Alka
1     Kush
2    Krish
Name: Name, dtype: object

In [31]:
df

    Name  Age   City
0   Alka   19  Dehli
1   Kush   20  Naini
2  Krish   60    Goa

In [35]:
print(df.at[1,'Name'])

Kush

In [37]:
df.iat[2,2] ## row index and column index

'Goa'

## Data Manipulation with dataframe

In [38]:
df

    Name  Age   City
0   Alka   19  Dehli
1   Kush   20  Naini
2  Krish   60    Goa

In [39]:
## Add a new column
df['Slary']=[20000,90000,7000]

In [40]:
df

    Name  Age   City  Slary
0   Alka   19  Dehli  20000
1   Kush   20  Naini  90000
2  Krish   60    Goa   7000

In [49]:
## Remove a column

## by default it is checking in the row index(axis) i.e 0 row


## df.drop('Slary',axis=1) ## it is not permanent
df.drop('Slary',axis=1,inplace=True)  ## it is now permanent

KeyError: "['Slary'] not found in axis"

In [50]:
df

    Name  Age   City
0   Alka   19  Dehli
1   Kush   20  Naini
2  Krish   60    Goa

In [51]:
## Add age to the column
df['Age']=df['Age']+1

In [52]:
df

    Name  Age   City
0   Alka   20  Dehli
1   Kush   21  Naini
2  Krish   61    Goa

In [55]:
## drop a row
df.drop(1,inplace=True)

In [57]:
df

    Name  Age   City
0   Alka   20  Dehli
2  Krish   61    Goa

In [59]:
##print("Satistical Summar:",df.describe())
print("Data type:")
df.describe()

Data type:

             Age
count   2.000000
mean   40.500000
std    28.991378
min    20.000000
25%    30.250000
50%    40.500000
75%    50.750000
max    61.000000